Rhino.Inside.Revit API
GeometryEncoder.ToXYZ Method (Point3f)
 Converts the specified Rhino.Geometry.Point3f to an equivalent Autodesk.Revit.DB.XYZ.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.XYZ ToXYZ(
	this Rhino.Geometry.Point3f point
)
@staticmethod
def ToXYZ(
	point: Rhino.Geometry.Point3f
) -> Autodesk.Revit.DB.XYZ
Parameters
point
Type: Rhino.Geometry.Point3f
Rhino point to convert.
Return Value
Type: Autodesk.Revit.DB.XYZ
Revit point that is equivalent to the provided Rhino point.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Point3f. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToXYZ(Point3f) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.XYZ revitXYZPoint = rhinoPoint3f.ToXYZ();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_xyzpoint = rhino_point3f.ToXYZ()    # type: DB.XYZ
 Using ToXYZ(Point3f) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.XYZ revitXYZPoint = GeometryEncoder.ToXYZ(rhinoPoint3f);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_xyzpoint = GE.ToXYZ(rhino_point3f)    # type: DB.XYZ
See Also
Reference
GeometryEncoder Class
ToXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace